================================================================================
empty
================================================================================

""

--------------------------------------------------------------------------------

(module
  (expr
    (subExpr
      (string
        (D_QUOTE)
        (D_QUOTE)))))

================================================================================
basic
================================================================================

"ab c"

--------------------------------------------------------------------------------

(module
  (expr
    (subExpr
      (string
        (D_QUOTE)
        (stringPart
          (STRING))
        (D_QUOTE)))))

================================================================================
interpolation
================================================================================

"foo {some(5)}"

--------------------------------------------------------------------------------

(module
  (expr
    (subExpr
      (string
        (D_QUOTE)
        (stringPart
          (STRING))
        (stringPart
          (O_BRACE)
          (expr
            (subExpr
              (identifier
                (NAME))
              (callOp
                (O_PAREN)
                (arg
                  (expr
                    (subExpr
                      (number
                        (INT)))))
                (C_PAREN))))
          (C_BRACE))
        (D_QUOTE)))))

================================================================================
interpolation nested
================================================================================

"foo {some("bar {6}")}"

--------------------------------------------------------------------------------

(module
  (expr
    (subExpr
      (string
        (D_QUOTE)
        (stringPart
          (STRING))
        (stringPart
          (O_BRACE)
          (expr
            (subExpr
              (identifier
                (NAME))
              (callOp
                (O_PAREN)
                (arg
                  (expr
                    (subExpr
                      (string
                        (D_QUOTE)
                        (stringPart
                          (STRING))
                        (stringPart
                          (O_BRACE)
                          (expr
                            (subExpr
                              (number
                                (INT))))
                          (C_BRACE))
                        (D_QUOTE)))))
                (C_PAREN))))
          (C_BRACE))
        (D_QUOTE)))))
